<?php
   $a = 500;
   $b = 501;

  echo "ตัวดำเนินการที่ 1".var_dump($a == $b)."<br>"; //เท่ากับ
  echo "ตัวดำเนินการที่ 2".var_dump($a === $b)."<br>"; //เหมือนกัน
  echo "ตัวดำเนินการที่ 3".var_dump($a != $b)."<br>"; //ไม่เท่ากับ
  echo "ตัวดำเนินการที่ 4".var_dump($a <> $b)."<br>"; //ไม่เท่ากับ
  echo "ตัวดำเนินการที่ 5".var_dump($a !== $b)."<br>"; //ไม่เหมือนกัน
  echo "ตัวดำเนินการที่ 6".var_dump($a > $b)."<br>"; //มากกว่า
  echo "ตัวดำเนินการที่ 7".var_dump($a < $b)."<br>"; //น้อยกว่า
  echo "ตัวดำเนินการที่ 8".var_dump($a >= $b)."<br>"; //มากกว่าหรือเท่ากับ
  echo "ตัวดำเนินการที่ 9".var_dump($a <= $b)."<br>"; //น้อยกว่าหรือเท่ากับ
  echo "ตัวดำเนินการที่ 10".var_dump($a <=> $b)."<br>"; //spaceship
  
  /*  
    spaceship
    a<b = -1
    a=b = 0
    a>b = 1
  */
?>